app/views/home/index.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."category_id" = $1  [["category_id", 1]]
---
  <div id="tab-<%= category.id  %>" class="tab-content current">
    <% category.tasks.each do |task|  %>